# Setting Up

In [1]:
import pandas as pd
import sys
import os

sys.path.append(os.path.abspath(os.path.join('..')))
from Utils.db_connect import get_connection

try:
  engine = get_connection()
  print("Connection to the database was successful.")
except Exception as e:
  print(f"An error occurred while connecting to the database: {e}")
  
query = "SELECT TOP 10 * FROM dbo.Medical_Cost;"
df = pd.read_sql(query, engine)
df.head()

Connection to the database was successful.

c:\Users\User\Personal Projects\SQL\.venv\Lib\site-packages\pandas\io\sql.py:1648: SAWarning: Unrecognized server version info '17.0.1000.7'.  Some SQL Server features may not function properly.
  con = self.exit_stack.enter_context(con.connect())

   age     sex        bmi  children  smoker     region       charges
0   19  female  27.900000         0    True  southwest  16884.923828
1   18    male  33.770000         1   False  southeast   1725.552246
2   28    male  33.000000         3   False  southeast   4449.461914
3   33    male  22.705000         0   False  northwest  21984.470703
4   32    male  28.879999         0   False  northwest   3866.855225